In [1]:
import numpy as np
import pandas as pd

# serijos

In [5]:
labels = ['x', 'y', 'z']
data = [20, 30, 40]
pd.Series(data=data, index=labels)

x    20
y    30
z    40
dtype: int64

In [6]:
zodynas = {'a':1, 'b':2, 'c':3, 'd':4, 'e':5}
pd.Series(data=zodynas)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [7]:
serija = pd.Series([1, 2, 3, 4, 5], ["Vilnius", "Kaunas", "Klaipėda", "Panevėžys", "Šiauliai"])
serija

Vilnius      1
Kaunas       2
Klaipėda     3
Panevėžys    4
Šiauliai     5
dtype: int64

In [8]:
serija['Panevėžys']

4

In [9]:
serija2 = pd.Series([1, 2, 3, 4, 5], ["Vilnius", "Kaunas", "Utena", "Šiauliai", "Klaipėda"])
serija2

Vilnius     1
Kaunas      2
Utena       3
Šiauliai    4
Klaipėda    5
dtype: int64

In [10]:
serija + serija2

Kaunas       4.0
Klaipėda     8.0
Panevėžys    NaN
Utena        NaN
Vilnius      2.0
Šiauliai     9.0
dtype: float64

# dataframes

In [90]:
df = pd.DataFrame(
    np.random.randint(0, 100, 30).reshape(5, 6),
    ['a', 'b', 'c', 'd', 'e'],
    ['U', 'V', 'W', 'X', 'Y', 'Z'],
)
df

    U   V   W   X   Y   Z
a  43  67  25  77  66  19
b  54  75  66  17   0  26
c   6  90   9  92  29  72
d  64  34   1  64  88  94
e  89  87  12  79  95  66

In [18]:
df['U']

a    35
b    64
c    63
d    75
e    88
Name: U, dtype: int64

In [19]:
df[['U', 'Z', 'X']]

    U   Z   X
a  35  18  14
b  64  94  83
c  63  70  41
d  75  17  72
e  88  74  19

In [33]:
df['Naujas'] = [x for x in np.random.randint(0, 100, 5)]
df

    U   V   W   X   Y   Z  Naujas
a  35  47  93  14  82  18      14
b  64  18  90  83  48  94      79
c  63  55  56  41  51  70      45
d  75   6  91  72  82  17      31
e  88  75  77  19  58  74      55

In [30]:
dfr = df.drop('Naujas', axis=1)
dfr

    U   V   W   X   Y   Z
a  35  47  93  14  82  18
b  64  18  90  83  48  94
c  63  55  56  41  51  70
d  75   6  91  72  82  17
e  88  75  77  19  58  74

In [34]:
df.drop('Naujas', axis=1, inplace=True)
df

    U   V   W   X   Y   Z
a  35  47  93  14  82  18
b  64  18  90  83  48  94
c  63  55  56  41  51  70
d  75   6  91  72  82  17
e  88  75  77  19  58  74

In [37]:
df.drop('e')
# df

    U   V   W   X   Y   Z
a  35  47  93  14  82  18
b  64  18  90  83  48  94
c  63  55  56  41  51  70
d  75   6  91  72  82  17

In [39]:
df.loc['c']

U    63
V    55
W    56
X    41
Y    51
Z    70
Name: c, dtype: int64

In [41]:
df.iloc[2]

U    63
V    55
W    56
X    41
Y    51
Z    70
Name: c, dtype: int64

In [43]:
df.loc[['a', 'c', 'e']]

    U   V   W   X   Y   Z
a  35  47  93  14  82  18
c  63  55  56  41  51  70
e  88  75  77  19  58  74

In [47]:
df.loc['a', ['X', 'Z']]

X    14
Z    18
Name: a, dtype: int64

In [45]:
df.loc[['a', 'c', 'e'], ['V', 'X', 'Z']]

    V   X   Z
a  47  14  18
c  55  41  70
e  75  19  74

In [50]:
df.loc['a':'c']

    U   V   W   X   Y   Z
a  35  47  93  14  82  18
b  64  18  90  83  48  94
c  63  55  56  41  51  70

In [52]:
df.iloc[::-1, ::-2]

    Z   X   V
e  74  19  75
d  17  72   6
c  70  41  55
b  94  83  18
a  18  14  47

# filtravimas

In [54]:
df[df>50]

      U     V   W     X     Y     Z
a   NaN   NaN  93   NaN  82.0   NaN
b  64.0   NaN  90  83.0   NaN  94.0
c  63.0  55.0  56   NaN  51.0  70.0
d  75.0   NaN  91  72.0  82.0   NaN
e  88.0  75.0  77   NaN  58.0  74.0

In [55]:
df[df['X']>50]

    U   V   W   X   Y   Z
b  64  18  90  83  48  94
d  75   6  91  72  82  17

In [57]:
df[df['X']>50][['X', 'Y', 'Z']]

    X   Y   Z
b  83  48  94
d  72  82  17

In [61]:
dfr = df[df['X']>50]
dfr[['X', 'Y', 'Z']]

    X   Y   Z
b  83  48  94
d  72  82  17

In [64]:
dfr.loc['b', ['Z', 'Y']]

Z    94
Y    48
Name: b, dtype: int64

In [66]:
df.loc['c']>50

U     True
V     True
W     True
X    False
Y     True
Z     True
Name: c, dtype: bool

## combo salygos

In [68]:
df

    U   V   W   X   Y   Z
a  35  47  93  14  82  18
b  64  18  90  83  48  94
c  63  55  56  41  51  70
d  75   6  91  72  82  17
e  88  75  77  19  58  74

In [72]:
df[(df['X'] > 40) & (df['Z'] <= 70)][['U', 'V']]

    U   V
c  63  55
d  75   6

In [80]:
df[(df['W'] >= 90) | (df['Z'] <= 70)]

    U   V   W   X   Y   Z
a  35  47  93  14  82  18
b  64  18  90  83  48  94
c  63  55  56  41  51  70
d  75   6  91  72  82  17

# operacijos su index'ais

In [91]:
df.reset_index(inplace=True)
df

  index   U   V   W   X   Y   Z
0     a  43  67  25  77  66  19
1     b  54  75  66  17   0  26
2     c   6  90   9  92  29  72
3     d  64  34   1  64  88  94
4     e  89  87  12  79  95  66

In [83]:
new_index = "Vilnius Kaunas Klaipėda Panevėžys Šiauliai".split()
new_index

['Vilnius', 'Kaunas', 'Klaipėda', 'Panevėžys', 'Šiauliai']

In [92]:
df['Miestai'] = new_index
df

  index   U   V   W   X   Y   Z    Miestai
0     a  43  67  25  77  66  19    Vilnius
1     b  54  75  66  17   0  26     Kaunas
2     c   6  90   9  92  29  72   Klaipėda
3     d  64  34   1  64  88  94  Panevėžys
4     e  89  87  12  79  95  66   Šiauliai

In [93]:
df.set_index('Miestai', inplace=True)

In [94]:
df

          index   U   V   W   X   Y   Z
Miestai
Vilnius       a  43  67  25  77  66  19
Kaunas        b  54  75  66  17   0  26
Klaipėda      c   6  90   9  92  29  72
Panevėžys     d  64  34   1  64  88  94
Šiauliai      e  89  87  12  79  95  66